app/controllers/api/v1/results_controller.rb

SELECT "results".* FROM "results"
---
      def index
        render json: Result.all

INSERT INTO "results" ("student_name", "subject", "marks", "submitted_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create
        result = Result.new(result_params)
        if result.save